<script lang="ts">
	import { page } from '$app/stores';
	let modal = false;

	const toggleModal = () => {
		modal = !modal;
	};

	import { onMount } from 'svelte';

	const user = 3;
	const STORAGE_KEY = 'theme';
	const DARK_PREFERENCE = '(prefers-color-scheme: dark)';

	const THEMES = {
		DARK: 'dark',
		LIGHT: 'light'
	};
	let currentTheme;
	const prefersDarkThemes = () => window.matchMedia(DARK_PREFERENCE).matches;

	const applyTheme = () => {
		const preferredTheme = prefersDarkThemes() ? THEMES.DARK : THEMES.LIGHT;

		currentTheme = localStorage.getItem(STORAGE_KEY) ?? preferredTheme;

		currentTheme = localStorage.getItem(STORAGE_KEY) ?? preferredTheme;

		if (currentTheme === THEMES.DARK) {
			document.body.classList.remove(THEMES.LIGHT);
			document.body.classList.add(THEMES.DARK);
		} else {
			document.body.classList.remove(THEMES.DARK);
			document.body.classList.add(THEMES.LIGHT);
		}
	};

	const toggleTheme = () => {
		const stored = localStorage.getItem(STORAGE_KEY);
		0;

		if (stored) {
			// Storage 초기화
			localStorage.removeItem(STORAGE_KEY);
		} else {
			localStorage.setItem(STORAGE_KEY, prefersDarkThemes() ? THEMES.LIGHT : THEMES.DARK);
		}

		applyTheme();
	};

	onMount(() => {
		applyTheme();
		window.matchMedia(DARK_PREFERENCE).addEventListener('change', applyTheme);
	});
</script>

<header
	class="sticky flex w-full h-16 self-start justify-center items-center transition ease-in-out delay-150 backdrop-blur-xl z-50 bg-ingobook-pink-200/80 top-0"
>
	<div class="w-[73.125rem] flex justify-between items-center">
		<div class="flex items-center blur-none gap-9">
			<a href="/" class="w-auto">
				<svg
					width="94"
					height="20"
					viewBox="0 0 94 20"
					fill="none"
					xmlns="http://www.w3.org/2000/svg"
				>
					<mask
						id="mask0_826_475"
						style="mask-type:alpha"
						maskUnits="userSpaceOnUse"
						x="76"
						y="1"
						width="18"
						height="18"
					>
						<rect x="76" y="1" width="18" height="18" fill="#C4C4C4" />
					</mask>
					<g mask="url(#mask0_826_475)">
						<path
							d="M86.5005 7.58137C86.5005 7.46887 86.5412 7.35312 86.6227 7.23412C86.7037 7.11562 86.7942 7.03762 86.8942 7.00012C87.2567 6.87512 87.6192 6.78137 87.9817 6.71887C88.3442 6.65637 88.7255 6.62512 89.1255 6.62512C89.3755 6.62512 89.6225 6.64062 89.8665 6.67162C90.11 6.70312 90.3505 6.74387 90.588 6.79387C90.7005 6.81887 90.7972 6.88137 90.8782 6.98137C90.9597 7.08137 91.0005 7.19387 91.0005 7.31887C91.0005 7.53137 90.9317 7.68762 90.7942 7.78762C90.6567 7.88762 90.4817 7.91262 90.2692 7.86262C90.0942 7.82512 89.91 7.79687 89.7165 7.77787C89.5225 7.75937 89.3255 7.75012 89.1255 7.75012C88.8005 7.75012 88.4817 7.78137 88.1692 7.84387C87.8567 7.90637 87.5567 7.98762 87.2692 8.08762C87.0442 8.17512 86.86 8.16887 86.7165 8.06887C86.5725 7.96887 86.5005 7.80637 86.5005 7.58137ZM86.5005 11.7064C86.5005 11.5939 86.5412 11.4781 86.6227 11.3591C86.7037 11.2406 86.7942 11.1626 86.8942 11.1251C87.2567 11.0001 87.6192 10.9064 87.9817 10.8439C88.3442 10.7814 88.7255 10.7501 89.1255 10.7501C89.3755 10.7501 89.6225 10.7656 89.8665 10.7966C90.11 10.8281 90.3505 10.8689 90.588 10.9189C90.7005 10.9439 90.7972 11.0064 90.8782 11.1064C90.9597 11.2064 91.0005 11.3189 91.0005 11.4439C91.0005 11.6564 90.9317 11.8126 90.7942 11.9126C90.6567 12.0126 90.4817 12.0376 90.2692 11.9876C90.0942 11.9501 89.91 11.9219 89.7165 11.9029C89.5225 11.8844 89.3255 11.8751 89.1255 11.8751C88.8005 11.8751 88.4817 11.9034 88.1692 11.9599C87.8567 12.0159 87.5567 12.0939 87.2692 12.1939C87.0442 12.2814 86.86 12.2781 86.7165 12.1841C86.5725 12.0906 86.5005 11.9314 86.5005 11.7064ZM86.5005 9.64387C86.5005 9.53137 86.5412 9.41562 86.6227 9.29662C86.7037 9.17812 86.7942 9.10012 86.8942 9.06262C87.2567 8.93762 87.6192 8.84387 87.9817 8.78137C88.3442 8.71887 88.7255 8.68762 89.1255 8.68762C89.3755 8.68762 89.6225 8.70312 89.8665 8.73412C90.11 8.76562 90.3505 8.80637 90.588 8.85637C90.7005 8.88137 90.7972 8.94387 90.8782 9.04387C90.9597 9.14387 91.0005 9.25637 91.0005 9.38137C91.0005 9.59387 90.9317 9.75012 90.7942 9.85012C90.6567 9.95012 90.4817 9.97512 90.2692 9.92512C90.0942 9.88762 89.91 9.85937 89.7165 9.84037C89.5225 9.82187 89.3255 9.81262 89.1255 9.81262C88.8005 9.81262 88.4817 9.84387 88.1692 9.90637C87.8567 9.96887 87.5567 10.0501 87.2692 10.1501C87.0442 10.2376 86.86 10.2314 86.7165 10.1314C86.5725 10.0314 86.5005 9.86887 86.5005 9.64387ZM85.7505 13.7876C86.3005 13.5251 86.8537 13.3281 87.4102 13.1966C87.9662 13.0656 88.538 13.0001 89.1255 13.0001C89.5755 13.0001 90.0162 13.0376 90.4477 13.1126C90.8787 13.1876 91.313 13.3001 91.7505 13.4501V6.02512C91.338 5.85012 90.91 5.71887 90.4665 5.63137C90.0225 5.54387 89.5755 5.50012 89.1255 5.50012C88.538 5.50012 87.9567 5.57512 87.3817 5.72512C86.8067 5.87512 86.263 6.10012 85.7505 6.40012V13.7876ZM85.0005 15.6064C84.8255 15.6064 84.66 15.5846 84.504 15.5411C84.3475 15.4971 84.2005 15.4376 84.063 15.3626C83.5755 15.0751 83.063 14.8596 82.5255 14.7161C81.988 14.5721 81.438 14.5001 80.8755 14.5001C80.3505 14.5001 79.835 14.5689 79.329 14.7064C78.8225 14.8439 78.338 15.0376 77.8755 15.2876C77.613 15.4251 77.36 15.4189 77.1165 15.2689C76.8725 15.1189 76.7505 14.9001 76.7505 14.6126V5.57512C76.7505 5.43762 76.785 5.30637 76.854 5.18137C76.9225 5.05637 77.0255 4.96262 77.163 4.90012C77.738 4.60012 78.338 4.37512 78.963 4.22512C79.588 4.07512 80.2255 4.00012 80.8755 4.00012C81.6005 4.00012 82.31 4.09387 83.004 4.28137C83.6975 4.46887 84.363 4.75012 85.0005 5.12512C85.638 4.75012 86.3037 4.46887 86.9977 4.28137C87.6912 4.09387 88.4005 4.00012 89.1255 4.00012C89.7755 4.00012 90.413 4.07512 91.038 4.22512C91.663 4.37512 92.263 4.60012 92.838 4.90012C92.9755 4.96262 93.0787 5.05637 93.1477 5.18137C93.2162 5.30637 93.2505 5.43762 93.2505 5.57512V14.6126C93.2505 14.9001 93.1287 15.1189 92.8852 15.2689C92.6412 15.4189 92.388 15.4251 92.1255 15.2876C91.663 15.0376 91.1785 14.8439 90.672 14.7064C90.166 14.5689 89.6505 14.5001 89.1255 14.5001C88.563 14.5001 88.013 14.5721 87.4755 14.7161C86.938 14.8596 86.4255 15.0751 85.938 15.3626C85.8005 15.4376 85.6537 15.4971 85.4977 15.5411C85.3412 15.5846 85.1755 15.6064 85.0005 15.6064Z"
							fill="#3C2727"
						/>
					</g>
					<path
						d="M1.152 4.272V16.176H3.072V4.272H1.152ZM11.2268 11.6V16.16H13.1308V11.312C13.1308 8.864 11.3548 7.728 9.40275 7.728C8.65075 7.728 7.64275 8.112 7.17875 8.912V7.728H5.27475V16.16H7.17875V11.664C7.14675 10.528 8.05875 9.6 9.21075 9.6C10.6028 9.6 11.2268 10.448 11.2268 11.6ZM18.787 14.368C17.283 14.368 16.579 13.328 16.579 11.936C16.579 10.592 17.283 9.552 18.787 9.552C19.971 9.552 21.011 10.592 21.011 11.936C21.011 13.328 19.971 14.368 18.787 14.368ZM14.627 11.952C14.627 14.4 16.083 16.224 18.643 16.224C19.363 16.224 20.403 15.904 21.155 14.864V15.92C21.139 17.376 19.635 17.904 18.547 17.904C17.955 17.904 17.011 17.632 16.451 16.784L14.835 17.856C15.619 19.04 17.059 19.776 18.547 19.776C21.027 19.776 23.059 18.336 23.075 15.68V7.664H21.155V9.008C20.483 7.968 19.347 7.712 18.643 7.712C16.083 7.712 14.627 9.536 14.627 11.952ZM28.5203 14.416C27.0803 14.416 26.1683 13.36 26.1683 11.952C26.1683 10.56 27.0803 9.504 28.5203 9.504C29.9603 9.504 30.8723 10.56 30.8723 11.952C30.8723 13.36 29.9603 14.416 28.5203 14.416ZM24.4083 11.952C24.4083 14.256 26.0403 16.224 28.5203 16.224C31.1123 16.224 32.6323 14.256 32.6323 11.952C32.6323 9.648 31.1123 7.68 28.5203 7.68C26.0403 7.68 24.4083 9.648 24.4083 11.952ZM38.3101 14.32C37.1581 14.32 36.1821 13.312 36.1821 11.984C36.1821 10.688 37.1581 9.664 38.3101 9.664C39.7821 9.664 40.4381 10.688 40.4381 11.984C40.4381 13.312 39.7821 14.32 38.3101 14.32ZM34.1501 16L36.0381 16.016V14.832C36.7581 15.904 37.7341 16.128 38.4701 16.128C40.9661 16.128 42.3581 14.224 42.3581 11.984C42.3581 9.776 40.9661 7.872 38.4701 7.872C37.7341 7.872 36.7261 8.208 36.0381 9.152V3.936H34.1501V16ZM47.8171 14.416C46.3771 14.416 45.4651 13.36 45.4651 11.952C45.4651 10.56 46.3771 9.504 47.8171 9.504C49.2571 9.504 50.1691 10.56 50.1691 11.952C50.1691 13.36 49.2571 14.416 47.8171 14.416ZM43.7051 11.952C43.7051 14.256 45.3371 16.224 47.8171 16.224C50.4091 16.224 51.9291 14.256 51.9291 11.952C51.9291 9.648 50.4091 7.68 47.8171 7.68C45.3371 7.68 43.7051 9.648 43.7051 11.952ZM57.3953 14.416C55.9553 14.416 55.0433 13.36 55.0433 11.952C55.0433 10.56 55.9553 9.504 57.3953 9.504C58.8353 9.504 59.7473 10.56 59.7473 11.952C59.7473 13.36 58.8353 14.416 57.3953 14.416ZM53.2833 11.952C53.2833 14.256 54.9153 16.224 57.3953 16.224C59.9873 16.224 61.5073 14.256 61.5073 11.952C61.5073 9.648 59.9873 7.68 57.3953 7.68C54.9153 7.68 53.2833 9.648 53.2833 11.952ZM64.9931 3.936H63.0891V16.208H64.9931V14.08L66.0651 12.8L68.3211 16.208H70.5131L67.2971 11.472L70.6251 7.776H68.2251L64.9931 11.392V3.936Z"
						fill="#3C2727"
					/>
				</svg>
			</a>

			<ul class="ml-2 flex list-none items-center justify-between w-auto gap-9">
				<li>
					<a
						sveltekit:prefetch
						href="/search"
						class:selected={$page.url.pathname === '/search'}
						class="no-underline text-sm transition ease-in-out delay-150 text-ingobook-brown-100"
					>
						학년별 찾기
					</a>
				</li>
				<li>
					<a
						sveltekit:prefetch
						href="/list"
						class:selected={$page.url.pathname === '/list'}
						class="no-underline text-sm transition ease-in-out delay-150 text-ingobook-brown-100"
					>
						교과서 목록
					</a>
				</li>
				<li>
					<a
						sveltekit:prefetch
						href="/info/service"
						class:selected={$page.url.pathname === '/info/service'}
						class="no-underline text-sm transition ease-in-out delay-150 text-ingobook-brown-100"
					>
						서비스 소개
					</a>
				</li>
				<li>
					<a
						sveltekit:prefetch
						href="/info/team"
						class:selected={$page.url.pathname === '/info/team'}
						class="no-underline text-sm transition ease-in-out delay-150 text-ingobook-brown-100"
					>
						팀 소개
					</a>
				</li>
			</ul>
		</div>
		<div class="flex items-center w-auto justify-between">
			<div
				class="flex items-center justify-between mr-[44px] hover:cursor-pointer gap-2 w-auto"
				on:click={toggleTheme}
			>
				<span class="text-sm transition ease-in-out delay-150 text-ingobook-brown-300"
					>다크 모드</span
				>
				{#if currentTheme !== THEMES.DARK}
					<div class="text-sm text-ingobook-brown-100">OFF</div>
				{:else}
					<div class="text-sm text-ingobook-coral">ON</div>
				{/if}
			</div>
			<div class="flex items-center">
				{#if user != null}
					<div class="w-auto flex items-center justify-between gap-3">
						<div
							class="bg-zinc-900  rounded-full w-6 h-6"
							on:click={toggleModal}
							on:fly={{ y: -25, duration: 1000 }}
						>
							{#if modal}
								<div class="modal">
									<ul>
										<li>다크 모드</li>
										<li>설정</li>
										<li>계정 설정</li>
									</ul>
								</div>
							{/if}
						</div>
						<div class="text-sm font-medium text-ingobook-brown-300">솦과0짱이될테야</div>
					</div>
				{:else}
					<div class="profile_info">
						<a sveltekit:prefetch href="/auth/login" class="lgnBtn">로그인</a>
					</div>
				{/if}
			</div>
		</div>
	</div>
</header>

<style lang="scss">
	.modal {
		position: absolute;
		display: flex;
		padding: 20px 16px 20px 16px;
		background: #fefafa;
		box-shadow: 0 4px 8px #0000000d;
		border: 1px solid #ffe3e3;
		border-radius: 16px;
		top: 68px;
		overflow: hidden;
	}

	path {
		fill: var(--logo-color);
		transition: fill 0.3 ease-in-out;
	}
</style>
